<a href="https://colab.research.google.com/github/federicoding/TrainingGeneral/blob/main/Debut.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Train Python

In [1]:
import pandas as pd

In [2]:
url = 'https://raw.githubusercontent.com/federicoding/TrainingGeneral/main/Transactions.csv'
transactions = pd.read_csv(filepath_or_buffer=url, sep=',', header=0, index_col="transaction_id")

In [4]:
transactions.head()

                cust_id   tran_date  ...  total_amt  Store_type
transaction_id                       ...
80712190438      270351  28-02-2014  ...  -4265.300      e-Shop
29258453508      270384  27-02-2014  ...  -8270.925      e-Shop
51750724947      273420  24-02-2014  ...  -1748.110    TeleShop
93274880719      271509  24-02-2014  ...  -4518.345      e-Shop
51750724947      273420  23-02-2014  ...  -1748.110    TeleShop

[5 rows x 9 columns]

In [5]:
transactions.shape

(23053, 9)

Préparation des variables catégorielles et quatitatives

In [7]:
cat_vars = transactions[['cust_id', 'tran_date', 'prod_subcat_code', 'prod_cat_code', 'Store_type']]
num_vars = transactions[['Qty', 'Rate', 'Tax', 'total_amt']]
print(cat_vars.head())
num_vars.head()

                cust_id   tran_date  prod_subcat_code  prod_cat_code Store_type
transaction_id
80712190438      270351  28-02-2014                 1              1     e-Shop
29258453508      270384  27-02-2014                 5              3     e-Shop
51750724947      273420  24-02-2014                 6              5   TeleShop
93274880719      271509  24-02-2014                11              6     e-Shop
51750724947      273420  23-02-2014                 6              5   TeleShop

                Qty  Rate      Tax  total_amt
transaction_id
80712190438      -5  -772  405.300  -4265.300
29258453508      -5 -1497  785.925  -8270.925
51750724947      -2  -791  166.110  -1748.110
93274880719      -3 -1363  429.345  -4518.345
51750724947      -2  -791  166.110  -1748.110

On split vite fait des données.

In [8]:
transactions_eshop = transactions.loc[transactions.Store_type=='e-Shop']
transactions_id_date = transactions_eshop[['cust_id','tran_date']]
transactions_id_date.head()

                cust_id   tran_date
transaction_id
80712190438      270351  28-02-2014
29258453508      270384  27-02-2014
93274880719      271509  24-02-2014
45649838090      273667  22-02-2014
50076728598      269014  21-02-2014

On regarde un client en particulier

In [9]:
transactions_client_268819 = transactions[transactions['cust_id'] == 268819]

total = 0

for amount in transactions_client_268819['total_amt']:
  total += amount

print(total)

14911.974999999999

Stats de base

In [11]:
transactions.describe()

             cust_id  prod_subcat_code  ...           Tax     total_amt
count   23053.000000      23053.000000  ...  23053.000000  23053.000000
mean   271021.746497          6.149091  ...    248.667192   2107.308002
std      2431.692059          3.726372  ...    187.177773   2507.561264
min    266783.000000          1.000000  ...      7.350000  -8270.925000
25%    268935.000000          3.000000  ...     98.280000    762.450000
50%    270980.000000          5.000000  ...    199.080000   1754.740000
75%    273114.000000         10.000000  ...    365.715000   3569.150000
max    275265.000000         12.000000  ...    787.500000   8287.500000

[8 rows x 7 columns]

In [12]:
transactions.Store_type.value_counts()

e-Shop            9311
MBR               4661
Flagship store    4577
TeleShop          4504
Name: Store_type, dtype: int64

In [13]:
transactions['Store_type'].value_counts()

e-Shop            9311
MBR               4661
Flagship store    4577
TeleShop          4504
Name: Store_type, dtype: int64

Questions sur des résultats du describe.
Soit on affiche direct le describe et on se met à lire.
Soit on demande les quantités, direct, c'est ce que je vais faire ici.

In [14]:
transactions.total_amt.mean(),transactions.Qty.max()

(2107.3080019953964, 5)

On peut bidouiller 'en avance de phase' les datas

In [15]:
transactions[transactions['total_amt'] > 0].describe()

             cust_id  prod_subcat_code  ...           Tax     total_amt
count   20876.000000      20876.000000  ...  20876.000000  20876.000000
mean   271027.141981          6.156639  ...    247.861232   2608.444389
std      2433.338935          3.722363  ...    186.644248   1964.208517
min    266783.000000          1.000000  ...      7.350000     77.350000
25%    268938.000000          3.000000  ...     97.938750   1030.688750
50%    271004.000000          5.000000  ...    198.555000   2089.555000
75%    273122.250000         10.000000  ...    363.510000   3825.510000
max    275265.000000         12.000000  ...    787.500000   8287.500000

[8 rows x 7 columns]

In [16]:
#ou
transactions[transactions['total_amt'] > 0].total_amt.mean()

2608.444389250814

#Data cleaning rapide

In [18]:
#reboot?
url = 'https://raw.githubusercontent.com/federicoding/TrainingGeneral/main/Transactions.csv'
transactions = pd.read_csv(filepath_or_buffer=url, sep=',', header=0, index_col="transaction_id")

Recherche de duplicates

In [19]:
print("Il y a : ",transactions.duplicated().sum(), "doublons dans le dataframe de transactions")

Il y a :  13 doublons dans le dataframe de transactions

In [20]:
transactions = transactions.drop_duplicates(keep='first')
transactions

                cust_id   tran_date  ...  total_amt  Store_type
transaction_id                       ...
80712190438      270351  28-02-2014  ...  -4265.300      e-Shop
29258453508      270384  27-02-2014  ...  -8270.925      e-Shop
51750724947      273420  24-02-2014  ...  -1748.110    TeleShop
93274880719      271509  24-02-2014  ...  -4518.345      e-Shop
51750724947      273420  23-02-2014  ...  -1748.110    TeleShop
...                 ...         ...  ...        ...         ...
94340757522      274550  25-01-2011  ...   1396.720      e-Shop
89780862956      270022  25-01-2011  ...    748.085      e-Shop
85115299378      271020  25-01-2011  ...   4649.840         MBR
72870271171      270911  25-01-2011  ...   3785.730    TeleShop
77960931771      271961  25-01-2011  ...    493.935    TeleShop

[23040 rows x 9 columns]

In [21]:
transactions.drop_duplicates(subset='prod_cat_code', keep='first')

                cust_id   tran_date  ...  total_amt      Store_type
transaction_id                       ...
80712190438      270351  28-02-2014  ...  -4265.300          e-Shop
29258453508      270384  27-02-2014  ...  -8270.925          e-Shop
51750724947      273420  24-02-2014  ...  -1748.110        TeleShop
93274880719      271509  24-02-2014  ...  -4518.345          e-Shop
43134751727      268487  20-02-2014  ...   -675.155          e-Shop
25963520987      274829  20-02-2014  ...   1664.130  Flagship store

[6 rows x 9 columns]

In [4]:
url = 'https://raw.githubusercontent.com/federicoding/TrainingGeneral/main/Transactions.csv'
transactions = pd.read_csv(filepath_or_buffer=url, sep=',', header=0, index_col="transaction_id")

transactions = transactions.drop_duplicates(keep = 'first')

In [3]:
import numpy as np

On va remplacer des modalités, convertir et renommer des colonnes

In [ ]:
transactions = transactions.replace(['e-Shop', 'TeleShop', 'MBR', 'Flagship store', np.nan],
                                   [1, 2, 3, 4, 0])
print(transactions.head(10))

new_types = {'Store_type'        : 'int',
             'prod_sub_cat_code' : 'int'}

transactions = transactions.astype(new_types)

#new_names = {'Store_type'  : 'store_type',
new_names = { 'Qty'        : 'qty',
              'Rate'       : 'rate',
              'Tax'        : 'tax'}

transactions = transactions.rename(new_names, axis = 1)

transactions.head()

Bon, ça galère en dictionnary ><

In [5]:
transactions = transactions.replace(['e-Shop', 'TeleShop', 'MBR', 'Flagship store', np.nan],
                                   [1, 2, 3, 4, 0])

In [6]:
transactions['Store_type'] = transactions['Store_type'].astype('int')

In [7]:
transactions['prod_subcat_code'] = transactions['prod_subcat_code'].astype('int')

In [8]:
new_names = {'Store_type'  : 'store_type',
              'Qty'        : 'qty',
              'Rate'       : 'rate',
              'Tax'        : 'tax'}

transactions = transactions.rename(new_names, axis = 1)

transactions.head()

                cust_id   tran_date  ...  total_amt  store_type
transaction_id                       ...
80712190438      270351  28-02-2014  ...  -4265.300           1
29258453508      270384  27-02-2014  ...  -8270.925           1
51750724947      273420  24-02-2014  ...  -1748.110           2
93274880719      271509  24-02-2014  ...  -4518.345           1
51750724947      273420  23-02-2014  ...  -1748.110           2

[5 rows x 9 columns]

On va split la date (qui est en texte) en trois valeurs traitables (pas du texte quoi ^^)

Pour ça on crée 3 fonctions qui splittent et renvoient un n-ième élément, et ensuite on l'applique au jeu de données avec un **apply**

In [50]:
transactions = transactions[~transactions['tran_date'].str.contains(pat='/')]

**Nota Bene** ce connard de programme n'autorisait pas la déclaration de plusieurs fonctions dans une même call ><

In [34]:
transactions['tran_date'].isnull().values.any()

False

In [24]:
transactions['tran_date'].iloc[0].split('-')[2]

'2014'

In [ ]:
def get_day(date) :
    return date.split("-")[0]

In [28]:
def get_month(date) :
    return date.split("-")[1]

In [29]:
def get_year(date) :
    return date.split("-")[1]

**ça marche une fois qu'on a filtré toutes les dates avec putain de /**

In [51]:
transactions['day'], transactions['month'], transactions['year'] = transactions.tran_date.apply(get_day), transactions.tran_date.apply(get_month), transactions.tran_date.apply(get_year)
transactions.head(10)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

                cust_id   tran_date  prod_subcat_code  ...  day  month  year
transaction_id                                         ...
80712190438      270351  28-02-2014                 1  ...   28     02    02
29258453508      270384  27-02-2014                 5  ...   27     02    02
51750724947      273420  24-02-2014                 6  ...   24     02    02
93274880719      271509  24-02-2014                11  ...   24     02    02
51750724947      273420  23-02-2014                 6  ...   23     02    02
97439039119      272357  23-02-2014                 8  ...   23     02    02
45649838090      273667  22-02-2014                11  ...   22     02    02
22643667930      271489  22-02-2014                12  ...   22     02    02
79792372943      275108  22-02-2014                 3  ...   22     02    02
50076728598      269014  21-02-2014                 8  ...   21     02    02

[10 rows x 12 columns]

In [36]:
days = transactions['tran_date'].apply(get_day)

In [ ]:
months = transactions['tran_date'].apply(get_month)

In [ ]:
years = transactions['tran_date'].apply(get_year)

Je perds patience mais il semble que certaines dates n'aient pas le bon format / longueur

In [41]:
transactions['tran_date'].sort_values( key = lambda x: x.str.len())

transaction_id
71286190189      5/9/2011
76929396378      8/4/2013
79507616107      8/4/2013
64276885615      8/4/2013
6539826915       8/4/2013
                  ...
7199499669     19-11-2012
32511506570    19-11-2012
35525966352    19-11-2012
99959918143    19-11-2012
77960931771    25-01-2011
Name: tran_date, Length: 23040, dtype: object

OK y a des dates qui ont des **putain de / de mes deux**, forcément, en split sur **-** ben ça passe pas ><

Faudrait filtrer et tout et tout, mais pour l'instant, je passe...

Ou alors, petit détour vite fait...

In [44]:
y_a_un_slash = transactions['tran_date'].str.contains(pat = '/')
y_a_un_slash

transaction_id
71286190189     True
76929396378     True
79507616107     True
64276885615     True
6539826915      True
               ...
7199499669     False
32511506570    False
35525966352    False
99959918143    False
77960931771    False
Name: tran_date, Length: 23040, dtype: bool

In [48]:
transactions2 = transactions[~transactions['tran_date'].str.contains(pat='/')]

In [49]:
transactions2.describe()

             cust_id  prod_subcat_code  ...     total_amt    store_type
count   13918.000000      13918.000000  ...  13918.000000  13918.000000
mean   271043.425277          6.122288  ...   2114.047129      2.201466
std      2428.196652          3.732157  ...   2521.095774      1.166313
min    266783.000000          1.000000  ...  -8270.925000      1.000000
25%    268969.000000          3.000000  ...    762.450000      1.000000
50%    271027.000000          5.000000  ...   1763.580000      2.000000
75%    273121.750000         10.000000  ...   3606.720000      3.000000
max    275265.000000         12.000000  ...   8287.500000      4.000000

[8 rows x 8 columns]

On passe à la détection des valeurs manquantes...